In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/scientists.csv')

In [3]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [6]:
df['Age'].mean()

59.125

In [7]:
df['Age'].min()

37

In [8]:
df['Age'].max()

90

In [9]:
df[df['Age']>df['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [11]:
df[df['Age']>df['Age'].min()]

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [12]:
df['Age']>df['Age'].min()

0    False
1     True
2     True
3     True
4     True
5     True
6     True
7     True
Name: Age, dtype: bool

In [14]:
ages = df['Age']

In [18]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [17]:
ages+10

0     47
1     71
2    100
3     76
4     66
5     55
6     51
7     87
Name: Age, dtype: int64

In [19]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [20]:
ages.sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [21]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [22]:
rev = ages.sort_index(ascending=False)

In [23]:
rev

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [24]:
rev+ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [25]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [32]:
df[df['Age']>df['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [27]:
a =df['Age']

In [29]:
a[a>a.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [34]:
pd.to_datetime(df['Born'],format='%Y-%m-%d')

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [40]:
pd.to_datetime('2000년 1월 2일',format='%Y년 %m월 %d일')

Timestamp('2000-01-02 00:00:00')

In [45]:
pd.to_datetime('2022년 7월 26일 화요일',format='%Y년 %m월 %d일 %A')

ValueError: time data '2022년 7월 26일 화' does not match format '%Y년 %m월 %d일 %A' (match)

In [46]:
df['born_dt']= pd.to_datetime(df['Born'],format='%Y-%m-%d')
df['died_dt']=pd.to_datetime(df['Died'],format='%Y-%m-%d')

In [47]:
df.head(2)

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   born_dt     8 non-null      datetime64[ns]
 6   died_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 576.0+ bytes

In [49]:
df['died_dt']-df['born_dt']

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [50]:
import random

In [53]:
random.seed(0)

In [57]:
random.randint(1,100)

6

In [58]:
df.drop(columns='Age')

,Name,Born,Died,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23

In [61]:
df.to_csv('df.csv',index=False)

In [62]:
df.to_dict()

{'Name': {0: 'Rosaline Franklin',
  1: 'William Gosset',
  2: 'Florence Nightingale',
  3: 'Marie Curie',
  4: 'Rachel Carson',
  5: 'John Snow',
  6: 'Alan Turing',
  7: 'Johann Gauss'},
 'Born': {0: '1920-07-25',
  1: '1876-06-13',
  2: '1820-05-12',
  3: '1867-11-07',
  4: '1907-05-27',
  5: '1813-03-15',
  6: '1912-06-23',
  7: '1777-04-30'},
 'Died': {0: '1958-04-16',
  1: '1937-10-16',
  2: '1910-08-13',
  3: '1934-07-04',
  4: '1964-04-14',
  5: '1858-06-16',
  6: '1954-06-07',
  7: '1855-02-23'},
 'Age': {0: 37, 1: 61, 2: 90, 3: 66, 4: 56, 5: 45, 6: 41, 7: 77},
 'Occupation': {0: 'Chemist',
  1: 'Statistician',
  2: 'Nurse',
  3: 'Chemist',
  4: 'Biologist',
  5: 'Physician',
  6: 'Computer Scientist',
  7: 'Mathematician'},
 'born_dt': {0: Timestamp('1920-07-25 00:00:00'),
  1: Timestamp('1876-06-13 00:00:00'),
  2: Timestamp('1820-05-12 00:00:00'),
  3: Timestamp('1867-11-07 00:00:00'),
  4: Timestamp('1907-05-27 00:00:00'),
  5: Timestamp('1813-03-15 00:00:00'),
  6: Timestamp('1912-06-23 00:00:00'),
  7: Timestamp('1777-04-30 00:00:00')},
 'died_dt': {0: Timestamp('1958-04-16 00:00:00'),
  1: Timestamp('1937-10-16 00:00:00'),
  2: Timestamp('1910-08-13 00:00:00'),
  3: Timestamp('1934-07-04 00:00:00'),
  4: Timestamp('1964-04-14 00:00:00'),
  5: Timestamp('1858-06-16 00:00:00'),
  6: Timestamp('1954-06-07 00:00:00'),
  7: Timestamp('1855-02-23 00:00:00')}}

In [64]:
df.to_excel('df.xlsx')

In [66]:
df.to_json('df.json',indent=2)

In [67]:
df.to_html('df.html')

In [69]:
df.to_pickle('df.txt')

In [70]:
pd.read_pickle('df.txt')

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [71]:
pd.read_json('df.json')

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,-1560124800000,-369619200000
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,-2952201600000,-1016496000000
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,-4722192000000,-1874102400000
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,-3223584000000,-1120176000000
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,-1975536000000,-180403200000
5,John Snow,1813-03-15,1858-06-16,45,Physician,-4948128000000,-3520022400000
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,-1815350400000,-491356800000
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,-6080140800000,-3624480000000

In [72]:
pd.read_html('df.html')

[   Unnamed: 0                  Name        Born        Died  Age  \
 0           0     Rosaline Franklin  1920-07-25  1958-04-16   37
 1           1        William Gosset  1876-06-13  1937-10-16   61
 2           2  Florence Nightingale  1820-05-12  1910-08-13   90
 3           3           Marie Curie  1867-11-07  1934-07-04   66
 4           4         Rachel Carson  1907-05-27  1964-04-14   56
 5           5             John Snow  1813-03-15  1858-06-16   45
 6           6           Alan Turing  1912-06-23  1954-06-07   41
 7           7          Johann Gauss  1777-04-30  1855-02-23   77

            Occupation     born_dt     died_dt
 0             Chemist  1920-07-25  1958-04-16
 1        Statistician  1876-06-13  1937-10-16
 2               Nurse  1820-05-12  1910-08-13
 3             Chemist  1867-11-07  1934-07-04
 4           Biologist  1907-05-27  1964-04-14
 5           Physician  1813-03-15  1858-06-16
 6  Computer Scientist  1912-06-23  1954-06-07
 7       Mathematician  1777-04-30  1855-02-23  ]

In [73]:
pd.read_excel('df.xlsx')

,Unnamed: 0,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-12,1937-10-16
2,2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-11,1910-08-13
3,3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-06,1934-07-04
4,4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-14,1858-06-15
6,6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-29,1855-02-22